examples/request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <getCountryRequest xmlns="http://app.io/hello/soap">
            <name>Spain</name>
        </getCountryRequest>
    </Body>
</Envelope>